<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads NoMAD</string>
    
    <key>Identifier</key>
    <string>com.github.tbridge.download.nomad</string>
    
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NoMAD</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.nomad.menu/download/NoMAD.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/NoMAD.pkg
</string>
                <key>expected_authority_names</key>
                <array>
                	<string>Developer ID Installer: Joel Rennich (AAPZK3CB24)</string>
                	<string>Developer ID Certification Authority</string>
            		<string>Apple Root CA</string>
            	</array>
            </dict>
        </dict>
    </array>
</dict>
</plist>